In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('Bengaluru_House_Data.csv')

In [4]:
df.sample(5)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
12306,Super built-up Area,Ready To Move,Whitefield,2 BHK,Soe 2Sa,1116,2.0,3.0,48.76
9733,Built-up Area,Ready To Move,Neelamangala,2 BHK,NaN,1163,2.0,2.0,68.00
2950,Plot Area,Ready To Move,8th block Koramangala,3 Bedroom,NaN,2400,3.0,2.0,290.00
4126,Plot Area,Ready To Move,Achins Road,7 Bedroom,NaN,2100,7.0,0.0,410.00
8842,Super built-up Area,Ready To Move,Electronic City,2 BHK,SraveSL,1096,2.0,2.0,39.00

In [10]:
df.shape

(13320, 9)

In [7]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [9]:
df2 = df.drop(['area_type','availability','society'],axis=1)
df2.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   balcony     12711 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(3), object(3)
memory usage: 624.5+ KB

In [16]:
df2.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [14]:
df2.balcony.describe()

count    12711.000000
mean         1.584376
std          0.817263
min          0.000000
25%          1.000000
50%          2.000000
75%          2.000000
max          3.000000
Name: balcony, dtype: float64

In [17]:
df2[df2.balcony==0]

             location       size   total_sqft  bath  balcony    price
24        Thanisandra       1 RK          510   1.0      0.0   25.250
30          Yelahanka      4 BHK  2100 - 2850   4.0      0.0  186.000
42        Ganga Nagar      1 BHK          600   1.0      0.0   38.000
43          Yelahanka  1 Bedroom          660   1.0      0.0   48.000
46       Doddathoguru      2 BHK          970   2.0      0.0   33.000
...               ...        ...          ...   ...      ...      ...
13260     Frazer Town      2 BHK         1420   2.0      0.0  120.000
13265           Hoodi      2 BHK  1133 - 1384   2.0      0.0   59.135
13291  Weavers Colony  1 Bedroom          812   1.0      0.0   26.000
13299      Whitefield      4 BHK  2830 - 2882   5.0      0.0  154.500
13315      Whitefield  5 Bedroom         3453   4.0      0.0  231.000

[1029 rows x 6 columns]